Gets the design option id of the element record.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2011
 Syntax
  C#
public ElementId GetDesignOptionId()
  Visual Basic
Public Function GetDesignOptionId As ElementId
  Visual C++
public:
ElementId^ GetDesignOptionId()
 Return Value
 The design option id.
 See Also
  ElementRecord Class
  Autodesk.Revit.DB Namespace